wolaite2024/jlab-jh5003-earphone/src/mcu/rtl87x3/arm/startup_rtl87x3d.s
;/*****************************************************************************/
;/*     startup_rtl8763.s: Startup file for Realtek RTL8763 device series     */
;/*****************************************************************************/
#include "mem_config.h"

__initial_sp    EQU     APP_GLOBAL_ADDR

                PRESERVE8
                THUMB

; Vector Table Mapped to Address 0 at Reset

                AREA    VECTOR, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size

__Vectors       DCD     __initial_sp              ; Top of Stack
                DCD     Reset_Handler             ; Reset Handler
                DCD     NMI_Handler               ; NMI Handler
                DCD     HardFault_Handler         ; Hard Fault Handler
                DCD     MemManage_Handler         ; MPU Fault Handler
                DCD     BusFault_Handler          ; Bus Fault Handler
                DCD     UsageFault_Handler        ; Usage Fault Handler
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     SVC_Handler               ; SVCall Handler
                DCD     DebugMon_Handler          ; Debug Monitor Handler
                DCD     0                         ; Reserved
                DCD     PendSV_Handler            ; PendSV Handler
                DCD     SysTick_Handler           ; SysTick Handler

                ; External Interrupts
                DCD     System_Handler            ;[0]  System On interrupt
                DCD     WDT_Handler               ;[1]  Watch dog global insterrupt
                DCD     BTMAC_Handler             ;[2]  See Below Table ( an Extension of interrupt )
                DCD     USB_IP_Handler  ;[3]  Master Peripheral IP interrupt (usb or sdio)
                DCD     TIM2_Handler              ;[4]  Timer2 global interrupt
                DCD     Platform_Handler          ;[5]  Platform interrupt (platfrom error interrupt)
                DCD     I2S0_TX_Handler            ;[6]  I2S0 interrupt
                DCD     I2S0_RX_Handler            ;[7]  I2S1 interrupt
                DCD     UART2_Handler             ;[8]  Data_Uart1 interrupt (used for DSP)
                DCD     GPIOA0_Handler            ;[9]  GPIOA0 interrupt
                DCD     GPIOA1_Handler            ;[10] GPIOA1 interrupt
                DCD     UART1_Handler             ;[11] Log_Uart interrupt (Log0)
                DCD     UART0_Handler             ;[12] Data_Uart interrupt
                DCD     RTC_Handler               ;[13] Realtime counter interrupt
                DCD     SPI0_Handler              ;[14] SPI0 interrupt
                DCD     SPI1_Handler              ;[15] SPI1 interrupt
                DCD     I2C0_Handler              ;[16] I2C0 interrupt
                DCD     I2C1_Handler              ;[17] I2C1 interrupt
                DCD     ADC_Handler               ;[18] ADC global interrupt
                DCD     Peripheral_Handler        ;[19] See Below Table ( an Extension of interrupt )
                DCD     GDMA0_Channel0_Handler    ;[20] RTK-DMA0 channel 0 global interrupt
                DCD     GDMA0_Channel1_Handler    ;[21] RTK-DMA0 channel 1 global interrupt
                DCD     GDMA0_Channel2_Handler    ;[22] RTK-DMA0 channel 2 global interrupt
                DCD     GDMA0_Channel3_Handler    ;[23] RTK-DMA0 channel 3 global interrupt
                DCD     GDMA0_Channel4_Handler    ;[24] RTK-DMA0 channel 4 global interrupt
                DCD     GDMA0_Channel5_Handler    ;[25] RTK-DMA0 channel 5 global interrupt
                DCD     KeyScan_Handler           ;[26] keyscan global interrupt
                DCD     QDEC_Handler              ;[27] qdecode global interrupt
                DCD     IR_Handler                ;[28] IR module global interrupt
                DCD     DSP_Handler               ;[29] DSP interrupt
                DCD     GDMA0_Channel6_Handler    ;[30] RTK-DMA0 channel 6 global interrupt
                DCD     GDMA0_Channel7_Handler    ;[31] RTK-DMA0 channel 7 global interrupt
                DCD     GDMA0_Channel8_Handler    ;[32] RTK-DMA0 channel 8 global interrupt
                DCD     GDMA0_Channel9_Handler    ;[33] RTK-DMA0 channel 9 global interrupt
                DCD     GDMA0_Channel10_Handler   ;[34] RTK-DMA0 channel 6 global interrupt
                DCD     GDMA0_Channel11_Handler   ;[35] RTK-DMA0 channel 7 global interrupt
                DCD     GDMA0_Channel12_Handler   ;[36] RTK-DMA0 channel 8 global interrupt
                DCD     GDMA0_Channel13_Handler   ;[37] RTK-DMA0 channel 9 global interrupt
                DCD     GDMA0_Channel14_Handler   ;[38] RTK-DMA0 channel 6 global interrupt
                DCD     GDMA0_Channel15_Handler   ;[39] RTK-DMA0 channel 7 global interrupt
                DCD     TIM3_Handler              ;[40] Timer3 global interrupt
                DCD     TIM4_Handler              ;[41] Timer4 global interrupt
                DCD     TIM5_Handler              ;[42] Timer5 global interrupt
                DCD     TIM6_Handler              ;[43] Timer6 global interrupt
                DCD     TIM7_Handler              ;[44] Timer7 global interrupt
                DCD     TIM8to11_Handler              ;[45] TRNG interrupt
                DCD     GPIO_A_9_Handler          ;[46] GPIO_A[9] interrupt
                DCD     GPIO_A_16_Handler         ;[47] GPIO_A[16] interrupt
                DCD     GPIO_A_2to7_Handler       ;[48] GPIO_A[2:7] interrupt
                DCD     GPIO_A_8_10to15_Handler   ;[49] GPIO_A[8,10:15] interrupt
                DCD     GPIO_A_17to23_Handler     ;[50] GPIO_A[17:23] interrupt
                DCD     GPIO_A_24to31_Handler     ;[51] GPIO_A[24:31] interrupt
                DCD     GPIO_B_0to7_Handler       ;[52] GPIO_B[0:7] interrupt
                DCD     GPIO_B_8to15_Handler      ;[53] GPIO_B[8:15] interrupt
                DCD     GPIO_B_16to23_Handler     ;[54] GPIO_B[16:23] interrupt
                DCD     GPIO_B_24to31_Handler     ;[55] GPIO_B[24:31] interrupt
                DCD     UART3_Handler             ;[56] Uart3 interrupt(used for DSP)
                DCD     SPI2_Handler              ;[57] SPI2 interrupt
                DCD     I2C2_Handler              ;[58] I2C2 interrupt
                DCD     DSP_Event_1_Handler       ;[59] DSP event interrupt 1
                DCD     DSP_Event_2_Handler       ;[60] DSP event interrupt 2
                DCD     SHA256_Handler            ;[61] SHA256 interrupt
                DCD     USB_ISOC_Handler          ;[62] USB ISO interrupt
                DCD     BT_CLK_compare_Handler    ;[63] BT clock compare interrupt
                DCD     HW_RSA_Handler            ;[64] HW RSA interrupt
                DCD     PSRAM_Handler             ;[65] PSRAM interrupt
                DCD     Compare_clk_4_Handler     ;[66] Compare Clock interrupt 4
                DCD     Compare_clk_5_Handler     ;[67] Compare Clock interrupt 5
                DCD     dspdma_int_all_host_Handler    ;[68] RTK-DMA0 channel 0 global interrupt
                DCD     NNA_Handler    ;[69] RTK-DMA0 channel 1 global interrupt
                DCD     Compare_clk_9_Handler     ;[70] RTK-DMA0 channel 2 global interrupt
                DCD     Compare_clk_10_Handler    ;[71] RTK-DMA0 channel 3 global interrupt
                DCD     GPIO_C_0to7_Handler       ;[72] RTK-DMA0 channel 4 global interrupt
                DCD     GPIO_C_8to15_Handler      ;[73] RTK-DMA0 channel 5 global interrupt
                DCD     0                         ;[74] RTK-DMA0 channel 6 global interrupt
                DCD     0                         ;[75] RTK-DMA0 channel 7 global interrupt
                DCD     TIM8_Handler              ;[76] Timer8 global interrupt
                DCD     TIM9_Handler              ;[77] Timer9 global interrupt
                DCD     TIM10_Handler             ;[78] Timer10 global interrupt
                DCD     TIM11_Handler             ;[79] Timer11 global interrupt
                DCD     TIM12_Handler             ;[80] Timer12 global interrupt
                DCD     TIM13_Handler             ;[81] Timer13 global interrupt
                DCD     TIM14_Handler             ;[82] Timer14 global interrupt
                DCD     TIM15_Handler             ;[83] Timer15 global interrupt
                DCD     SPIC0_Handler             ;[84] SPIC0 interrupt
                DCD     SPIC1_Handler             ;[85] SPIC1 interrupt
                DCD     SPIC2_Handler             ;[86] SPIC2 interrupt
                DCD     SPIC3_Handler             ;[87] SPIC3 interrupt
                DCD     SDIO_HOST_Handler         ;[88] SDIO host interrupt
                DCD     SPIC4_Handler
                DCD     ERR_CORR_CODE_Handler
                DCD     SLAVE_PORT_MONITOR_Handler
                ;       Name,                     IRQ_NUM,  StatusBit
                DCD     RESERVED0_Handler         ;19,      0,
                DCD     RESERVED1_Handler         ;19,      1,
                DCD     RESERVED2_Handler         ;19,      2,
                DCD     RESERVED3_Handler         ;19,      3,
                DCD     RESERVED4_Handler         ;19,      4,
                DCD     RESERVED5_Handler         ;19,      5,
                DCD     RESERVED6_Handler         ;19,      6,
                DCD     SPDIF_Rx_Handler          ;19,      7,
                DCD     SPDIF_Tx_Handler          ;19,      8,
                DCD     MBIAS_MFG_DET_L_Handler   ;19,      9,
                DCD     SPI2W_Handler             ;19,      10,
                DCD     LPCOMP_Handler            ;19,      11,
                DCD     MBIAS_VBAT_DET_Handler    ;19,      12,
                DCD     MBIAS_ADP_DET_Handler     ;19,      13,
                DCD     HW_ASRC1_Handler          ;19,      14,
                DCD     HW_ASRC2_Handler          ;19,      15,
                DCD     VADBUF_Handler            ;19,      16,
                DCD     PTA_Mailbox_Handler       ;19,      17,
                DCD     DSP2MCU_Handler           ;19,      18,
                DCD     SPORT2_TX_Handler         ;19,      19,
                DCD     SPORT2_RX_Handler         ;19,      20,
                DCD     SPORT3_TX_Handler         ;19,      21,
                DCD     SPORT3_RX_Handler         ;19,      22,
                DCD     VAD_Handler               ;19,      23,
                DCD     ANC_Handler               ;19,      24,
                DCD     SPORT0_TX_Handler         ;19,      25,
                DCD     SPORT0_RX_Handler         ;19,      26,
                DCD     SPORT1_TX_Handler         ;19,      27,
                DCD     SPORT1_RX_Handler         ;19,      28,
                DCD     USB_UTMI_SUSPEND_N_Handler;19,      29,
                DCD     USB_DLPS_Resume_Handler   ;19,      30,
                DCD     RESERVED7_Handler        ;19,      31,
                DCD     ADP_IN_DET_Handler
                DCD     ADP_OUT_DET_Handler
                DCD     GPIOA2_Handler
                DCD     GPIOA3_Handler
                DCD     GPIOA4_Handler
                DCD     GPIOA5_Handler
                DCD     GPIOA6_Handler
                DCD     GPIOA7_Handler
                DCD     GPIOA8_Handler
                DCD     GPIOA9_Handler
                DCD     GPIOA10_Handler
                DCD     GPIOA11_Handler
                DCD     GPIOA12_Handler
                DCD     GPIOA13_Handler
                DCD     GPIOA14_Handler
                DCD     GPIOA15_Handler
                DCD     GPIOA16_Handler
                DCD     GPIOA17_Handler
                DCD     GPIOA18_Handler
                DCD     GPIOA19_Handler
                DCD     GPIOA20_Handler
                DCD     GPIOA21_Handler
                DCD     GPIOA22_Handler
                DCD     GPIOA23_Handler
                DCD     GPIOA24_Handler
                DCD     GPIOA25_Handler
                DCD     GPIOA26_Handler
                DCD     GPIOA27_Handler
                DCD     GPIOA28_Handler
                DCD     GPIOA29_Handler
                DCD     GPIOA30_Handler
                DCD     GPIOA31_Handler
                DCD     GPIOB0_Handler
                DCD     GPIOB1_Handler
                DCD     GPIOB2_Handler
                DCD     GPIOB3_Handler
                DCD     GPIOB4_Handler
                DCD     GPIOB5_Handler
                DCD     GPIOB6_Handler
                DCD     GPIOB7_Handler
                DCD     GPIOB8_Handler
                DCD     GPIOB9_Handler
                DCD     GPIOB10_Handler
                DCD     GPIOB11_Handler
                DCD     GPIOB12_Handler
                DCD     GPIOB13_Handler
                DCD     GPIOB14_Handler
                DCD     GPIOB15_Handler
                DCD     GPIOB16_Handler
                DCD     GPIOB17_Handler
                DCD     GPIOB18_Handler
                DCD     GPIOB19_Handler
                DCD     GPIOB20_Handler
                DCD     GPIOB21_Handler
                DCD     GPIOB22_Handler
                DCD     GPIOB23_Handler
                DCD     GPIOB24_Handler
                DCD     GPIOB25_Handler
                DCD     GPIOB26_Handler
                DCD     GPIOB27_Handler
                DCD     GPIOB28_Handler
                DCD     GPIOB29_Handler
                DCD     GPIOB30_Handler
                DCD     GPIOB31_Handler
                DCD     GPIOC0_Handler
                DCD     GPIOC1_Handler
                DCD     GPIOC2_Handler
                DCD     GPIOC3_Handler
                DCD     GPIOC4_Handler
                DCD     GPIOC5_Handler
                DCD     GPIOC6_Handler
                DCD     GPIOC7_Handler
                DCD     GPIOC8_Handler
                DCD     GPIOC9_Handler
                DCD     GPIOC10_Handler
                DCD     GPIOC11_Handler
                DCD     GPIOC12_Handler
                DCD     GPIOC13_Handler
                DCD     GPIOC14_Handler
                DCD     GPIOC15_Handler
__Vectors_End

__Vectors_Size  EQU     __Vectors_End - __Vectors

                AREA    RESET, CODE, READONLY

