wolaite2024/jlab-jh5003-earphone/src/mcu/rtl87x3/arm/startup_rtl87x3d.s
; Reset Handler
Reset_Handler   PROC
                EXPORT Reset_Handler               [WEAK]
                IMPORT system_init
                IMPORT __main

                IF     :DEF:__USE_C_LIBRARY_INIT; // use c library init

                LDR    R0, =system_init
                BLX    R0
                LDR    R0, =__main
                BX     R0

                ELSE

                ; write our init flow: copy rw, encrypted and clear zi
                ; data on rw, data on zi, buffer on rw, buffer on zi

                ; copy data on rw
                IMPORT |Load$$RAM_GLOBAL$$RW$$Base|
                IMPORT |Image$$RAM_GLOBAL$$RW$$Base|
                IMPORT |Image$$RAM_GLOBAL$$RW$$Length|
                LDR R0, =|Load$$RAM_GLOBAL$$RW$$Base|
                LDR R1, =|Image$$RAM_GLOBAL$$RW$$Base|
                LDR R2, =|Image$$RAM_GLOBAL$$RW$$Length|
                CMP R2, #0
                BEQ end_of_copy_data_on_rw
copy_data_on_rw
                LDR R3, [R0]
                ADDS R0, R0, #4
                STR R3, [R1]
                ADDS R1, R1, #4
                SUBS R2, R2, #4
                BNE copy_data_on_rw
end_of_copy_data_on_rw

                ; clear data on zi
                IMPORT |Image$$RAM_GLOBAL$$ZI$$Base|
                IMPORT |Image$$RAM_GLOBAL$$ZI$$Length|
                LDR R0, =|Image$$RAM_GLOBAL$$ZI$$Base|
                LDR R1, =|Image$$RAM_GLOBAL$$ZI$$Length|
                CMP R1, #0
                BEQ end_of_clear_data_on_zi
clear_data_on_zi
                STR R2, [R0]
                ADDS R0, R0, #4
                SUBS R1, R1, #4
                BNE clear_data_on_zi
end_of_clear_data_on_zi

                ; copy buffer on rw
                IMPORT |Load$$RAM_TEXT$$RW$$Base|
                IMPORT |Image$$RAM_TEXT$$RW$$Base|
                IMPORT |Image$$RAM_TEXT$$RW$$Length|
                LDR R0, =|Load$$RAM_TEXT$$RW$$Base|
                LDR R1, =|Image$$RAM_TEXT$$RW$$Base|
                LDR R2, =|Image$$RAM_TEXT$$RW$$Length|
                CMP R2, #0
                BEQ end_of_copy_buffer_on_rw
copy_buffer_on_rw
                LDR R3, [R0]
                ADDS R0, R0, #4
                STR R3, [R1]
                ADDS R1, R1, #4
                SUBS R2, R2, #4
                BNE copy_buffer_on_rw
end_of_copy_buffer_on_rw

                ; copy buffer on ro (for ram function)
                IMPORT |Load$$RAM_TEXT$$RO$$Base|
                IMPORT |Image$$RAM_TEXT$$RO$$Base|
                IMPORT |Image$$RAM_TEXT$$RO$$Length|
                LDR R0, =|Load$$RAM_TEXT$$RO$$Base|
                LDR R1, =|Image$$RAM_TEXT$$RO$$Base|
                LDR R2, =|Image$$RAM_TEXT$$RO$$Length|
                CMP R2, #0
                BEQ end_of_copy_buffer_on_ro
copy_buffer_on_ro
                LDR R3, [R0]
                ADDS R0, R0, #4
                STR R3, [R1]
                ADDS R1, R1, #4
                SUBS R2, R2, #4
                BNE copy_buffer_on_ro
end_of_copy_buffer_on_ro

                ; clear buffer on zi
                IMPORT |Image$$RAM_TEXT$$ZI$$Base|
                IMPORT |Image$$RAM_TEXT$$ZI$$Length|
                LDR R0, =|Image$$RAM_TEXT$$ZI$$Base|
                LDR R1, =|Image$$RAM_TEXT$$ZI$$Length|
                CMP R1, #0
                BEQ end_of_clear_buffer_on_zi
clear_buffer_on_zi
                STR R2, [R0]
                ADDS R0, R0, #4
                SUBS R1, R1, #4
                BNE clear_buffer_on_zi
				NOP
end_of_clear_buffer_on_zi







                IMPORT system_init
                IMPORT main
                LDR    R0, =system_init
                BLX    R0
                LDR    R0, =main
                BX     R0

                ENDIF ; end of macro __USE_C_LIBRARY_INIT

                ENDP ; end of Reset_Handler


                AREA    |.text|, CODE, READONLY
Default_Handler PROC
                EXPORT Default_Handler           [WEAK]
                EXPORT NMI_Handler               [WEAK]
                EXPORT HardFault_Handler         [WEAK]
                EXPORT MemManage_Handler         [WEAK]
                EXPORT BusFault_Handler          [WEAK]
                EXPORT UsageFault_Handler        [WEAK]
                EXPORT SVC_Handler               [WEAK]
                EXPORT DebugMon_Handler          [WEAK]
                EXPORT PendSV_Handler            [WEAK]
                EXPORT SysTick_Handler           [WEAK]
                EXPORT System_Handler            [WEAK]
                EXPORT WDT_Handler                      [WEAK]
                EXPORT BTMAC_Handler             [WEAK]
                EXPORT USB_IP_Handler                   [WEAK]
                EXPORT TIM2_Handler              [WEAK]
                EXPORT Platform_Handler                 [WEAK]
                EXPORT I2S0_TX_Handler              [WEAK]
                EXPORT I2S0_RX_Handler              [WEAK]
                EXPORT UART2_Handler                    [WEAK]
                EXPORT GPIOA0_Handler                   [WEAK]
                EXPORT GPIOA1_Handler                   [WEAK]
                EXPORT UART1_Handler                    [WEAK]
                EXPORT UART0_Handler                    [WEAK]
                EXPORT RTC_Handler               [WEAK]
                EXPORT SPI0_Handler              [WEAK]
                EXPORT SPI1_Handler              [WEAK]
                EXPORT I2C0_Handler              [WEAK]
                EXPORT I2C1_Handler              [WEAK]
                EXPORT ADC_Handler               [WEAK]
                EXPORT Peripheral_Handler        [WEAK]
                EXPORT GDMA0_Channel0_Handler    [WEAK]
                EXPORT GDMA0_Channel1_Handler    [WEAK]
                EXPORT GDMA0_Channel2_Handler    [WEAK]
                EXPORT GDMA0_Channel3_Handler    [WEAK]
                EXPORT GDMA0_Channel4_Handler    [WEAK]
                EXPORT GDMA0_Channel5_Handler    [WEAK]
                EXPORT KeyScan_Handler           [WEAK]
                EXPORT QDEC_Handler              [WEAK]
                EXPORT IR_Handler                [WEAK]
                EXPORT DSP_Handler               [WEAK]
                EXPORT GDMA0_Channel6_Handler    [WEAK]
                EXPORT GDMA0_Channel7_Handler    [WEAK]
                EXPORT GDMA0_Channel8_Handler           [WEAK]
                EXPORT GDMA0_Channel9_Handler           [WEAK]
                EXPORT GDMA0_Channel10_Handler          [WEAK]
                EXPORT GDMA0_Channel11_Handler          [WEAK]
                EXPORT GDMA0_Channel12_Handler          [WEAK]
                EXPORT GDMA0_Channel13_Handler          [WEAK]
                EXPORT GDMA0_Channel14_Handler          [WEAK]
                EXPORT GDMA0_Channel15_Handler          [WEAK]
                EXPORT TIM3_Handler              [WEAK]
                EXPORT TIM4_Handler              [WEAK]
                EXPORT TIM5_Handler              [WEAK]
                EXPORT TIM6_Handler              [WEAK]
                EXPORT TIM7_Handler              [WEAK]
                EXPORT TIM8to11_Handler                 [WEAK]
                EXPORT GPIO_A_9_Handler                 [WEAK]
                EXPORT GPIO_A_16_Handler                [WEAK]
                EXPORT GPIO_A_2to7_Handler              [WEAK]
                EXPORT GPIO_A_8_10to15_Handler          [WEAK]
                EXPORT GPIO_A_17to23_Handler            [WEAK]
                EXPORT GPIO_A_24to31_Handler            [WEAK]
                EXPORT GPIO_B_0to7_Handler              [WEAK]
                EXPORT GPIO_B_8to15_Handler             [WEAK]
                EXPORT GPIO_B_16to23_Handler            [WEAK]
                EXPORT GPIO_B_24to31_Handler            [WEAK]
                EXPORT UART3_Handler                    [WEAK]
                EXPORT SPI2_Handler                     [WEAK]
                EXPORT I2C2_Handler                     [WEAK]
                EXPORT DSP_Event_1_Handler              [WEAK]
                EXPORT DSP_Event_2_Handler              [WEAK]
                EXPORT SHA256_Handler                   [WEAK]
                EXPORT USB_ISOC_Handler                 [WEAK]
                EXPORT BT_CLK_compare_Handler           [WEAK]
                EXPORT HW_RSA_Handler                   [WEAK]
                EXPORT PSRAM_Handler                    [WEAK]
                EXPORT Compare_clk_4_Handler            [WEAK]
                EXPORT Compare_clk_5_Handler            [WEAK]
                EXPORT dspdma_int_all_host_Handler           [WEAK]
                EXPORT NNA_Handler           [WEAK]
                EXPORT Compare_clk_9_Handler           [WEAK]
                EXPORT Compare_clk_10_Handler           [WEAK]
                EXPORT GPIO_C_0to7_Handler           [WEAK]
                EXPORT GPIO_C_8to15_Handler           [WEAK]
                EXPORT TIM8_Handler                     [WEAK]
                EXPORT TIM9_Handler                     [WEAK]
                EXPORT TIM10_Handler                    [WEAK]
                EXPORT TIM11_Handler                    [WEAK]
                EXPORT TIM12_Handler                    [WEAK]
                EXPORT TIM13_Handler                    [WEAK]
                EXPORT TIM14_Handler                    [WEAK]
                EXPORT TIM15_Handler                    [WEAK]
                EXPORT SPIC0_Handler                    [WEAK]
                EXPORT SPIC1_Handler                    [WEAK]
                EXPORT SPIC2_Handler                    [WEAK]
                EXPORT SPIC3_Handler                    [WEAK]
                EXPORT SDIO_HOST_Handler                [WEAK]
                EXPORT SPIC4_Handler                    [WEAK]
                EXPORT ERR_CORR_CODE_Handler            [WEAK]
                EXPORT SLAVE_PORT_MONITOR_Handler                [WEAK]
                EXPORT RESERVED0_Handler                [WEAK]
                EXPORT RESERVED1_Handler                [WEAK]
                EXPORT RESERVED2_Handler                [WEAK]
                EXPORT RESERVED3_Handler                [WEAK]
                EXPORT RESERVED4_Handler                [WEAK]
                EXPORT RESERVED5_Handler                [WEAK]
                EXPORT RESERVED6_Handler                [WEAK]
                EXPORT SPDIF_Rx_Handler                 [WEAK]
                EXPORT SPDIF_Tx_Handler                 [WEAK]
                EXPORT MBIAS_MFG_DET_L_Handler          [WEAK]
                EXPORT SPI2W_Handler             [WEAK]
                EXPORT LPCOMP_Handler            [WEAK]
                EXPORT MBIAS_VBAT_DET_Handler           [WEAK]
                EXPORT MBIAS_ADP_DET_Handler            [WEAK]
                EXPORT HW_ASRC1_Handler                 [WEAK]
                EXPORT HW_ASRC2_Handler                 [WEAK]
                EXPORT VADBUF_Handler                   [WEAK]
                EXPORT PTA_Mailbox_Handler       [WEAK]
                EXPORT DSP2MCU_Handler                  [WEAK]
                EXPORT SPORT2_TX_Handler                [WEAK]
                EXPORT SPORT2_RX_Handler                [WEAK]
                EXPORT SPORT3_TX_Handler                [WEAK]
                EXPORT SPORT3_RX_Handler                [WEAK]
                EXPORT VAD_Handler                      [WEAK]
                EXPORT ANC_Handler                      [WEAK]
                EXPORT SPORT0_TX_Handler         [WEAK]
                EXPORT SPORT0_RX_Handler         [WEAK]
                EXPORT SPORT1_TX_Handler         [WEAK]
                EXPORT SPORT1_RX_Handler         [WEAK]
                EXPORT USB_UTMI_SUSPEND_N_Handler       [WEAK]
                EXPORT USB_DLPS_Resume_Handler          [WEAK]
                EXPORT TIM8to11_Handler                 [WEAK]
                EXPORT ADP_IN_DET_Handler        [WEAK]
                EXPORT ADP_OUT_DET_Handler       [WEAK]
                EXPORT GPIOA2_Handler                   [WEAK]
                EXPORT GPIOA3_Handler                   [WEAK]
                EXPORT GPIOA4_Handler                   [WEAK]
                EXPORT GPIOA5_Handler                   [WEAK]
                EXPORT GPIOA6_Handler                   [WEAK]
                EXPORT GPIOA7_Handler                   [WEAK]
                EXPORT GPIOA8_Handler                   [WEAK]
                EXPORT GPIOA9_Handler                   [WEAK]
                EXPORT GPIOA10_Handler                  [WEAK]
                EXPORT GPIOA11_Handler                  [WEAK]
                EXPORT GPIOA12_Handler                  [WEAK]
                EXPORT GPIOA13_Handler                  [WEAK]
                EXPORT GPIOA14_Handler                  [WEAK]
                EXPORT GPIOA15_Handler                  [WEAK]
                EXPORT GPIOA16_Handler                  [WEAK]
                EXPORT GPIOA17_Handler                  [WEAK]
                EXPORT GPIOA18_Handler                  [WEAK]
                EXPORT GPIOA19_Handler                  [WEAK]
                EXPORT GPIOA20_Handler                  [WEAK]
                EXPORT GPIOA21_Handler                  [WEAK]
                EXPORT GPIOA22_Handler                  [WEAK]
                EXPORT GPIOA23_Handler                  [WEAK]
                EXPORT GPIOA24_Handler                  [WEAK]
                EXPORT GPIOA25_Handler                  [WEAK]
                EXPORT GPIOA26_Handler                  [WEAK]
                EXPORT GPIOA27_Handler                  [WEAK]
                EXPORT GPIOA28_Handler                  [WEAK]
                EXPORT GPIOA29_Handler                  [WEAK]
                EXPORT GPIOA30_Handler                  [WEAK]
                EXPORT GPIOA31_Handler                  [WEAK]
                EXPORT GPIOB0_Handler                   [WEAK]
                EXPORT GPIOB1_Handler                   [WEAK]
                EXPORT GPIOB2_Handler                   [WEAK]
                EXPORT GPIOB3_Handler                   [WEAK]
                EXPORT GPIOB4_Handler                   [WEAK]
                EXPORT GPIOB5_Handler                   [WEAK]
                EXPORT GPIOB6_Handler                   [WEAK]
                EXPORT GPIOB7_Handler                   [WEAK]
                EXPORT GPIOB8_Handler                   [WEAK]
                EXPORT GPIOB9_Handler                   [WEAK]
                EXPORT GPIOB10_Handler                  [WEAK]
                EXPORT GPIOB11_Handler                  [WEAK]
                EXPORT GPIOB12_Handler                  [WEAK]
                EXPORT GPIOB13_Handler                  [WEAK]
                EXPORT GPIOB14_Handler                  [WEAK]
                EXPORT GPIOB15_Handler                  [WEAK]
                EXPORT GPIOB16_Handler                  [WEAK]
                EXPORT GPIOB17_Handler                  [WEAK]
                EXPORT GPIOB18_Handler                  [WEAK]
                EXPORT GPIOB19_Handler                  [WEAK]
                EXPORT GPIOB20_Handler                  [WEAK]
                EXPORT GPIOB21_Handler                  [WEAK]
                EXPORT GPIOB22_Handler                  [WEAK]
                EXPORT GPIOB23_Handler                  [WEAK]
                EXPORT GPIOB24_Handler                  [WEAK]
                EXPORT GPIOB25_Handler                  [WEAK]
                EXPORT GPIOB26_Handler                  [WEAK]
                EXPORT GPIOB27_Handler                  [WEAK]
                EXPORT GPIOB28_Handler                  [WEAK]
                EXPORT GPIOB29_Handler                  [WEAK]
                EXPORT GPIOB30_Handler                  [WEAK]
                EXPORT GPIOB31_Handler                  [WEAK]
                EXPORT GPIOC0_Handler                   [WEAK]
                EXPORT GPIOC1_Handler                   [WEAK]
                EXPORT GPIOC2_Handler                   [WEAK]
                EXPORT GPIOC3_Handler                   [WEAK]
                EXPORT GPIOC4_Handler                   [WEAK]
                EXPORT GPIOC5_Handler                   [WEAK]
                EXPORT GPIOC6_Handler                   [WEAK]
                EXPORT GPIOC7_Handler                   [WEAK]
                EXPORT GPIOC8_Handler                   [WEAK]
                EXPORT GPIOC9_Handler                   [WEAK]
                EXPORT GPIOC10_Handler                  [WEAK]
                EXPORT GPIOC11_Handler                  [WEAK]
                EXPORT GPIOC12_Handler                  [WEAK]
                EXPORT GPIOC13_Handler                  [WEAK]
                EXPORT GPIOC14_Handler                  [WEAK]
                EXPORT GPIOC15_Handler                  [WEAK]
NMI_Handler
HardFault_Handler
MemManage_Handler
BusFault_Handler
UsageFault_Handler
SVC_Handler
DebugMon_Handler
PendSV_Handler
SysTick_Handler
System_Handler
WDT_Handler
BTMAC_Handler
USB_IP_Handler
TIM2_Handler
Platform_Handler
I2S0_TX_Handler
I2S0_RX_Handler
UART2_Handler
GPIOA0_Handler
GPIOA1_Handler
UART1_Handler
UART0_Handler
RTC_Handler
SPI0_Handler
SPI1_Handler
I2C0_Handler
I2C1_Handler
ADC_Handler
Peripheral_Handler
GDMA0_Channel0_Handler
GDMA0_Channel1_Handler
GDMA0_Channel2_Handler
GDMA0_Channel3_Handler
GDMA0_Channel4_Handler
GDMA0_Channel5_Handler
KeyScan_Handler
QDEC_Handler
IR_Handler
DSP_Handler
GDMA0_Channel6_Handler
GDMA0_Channel7_Handler
GDMA0_Channel8_Handler
GDMA0_Channel9_Handler
GDMA0_Channel10_Handler
GDMA0_Channel11_Handler
GDMA0_Channel12_Handler
GDMA0_Channel13_Handler
GDMA0_Channel14_Handler
GDMA0_Channel15_Handler
TIM3_Handler
TIM4_Handler
TIM5_Handler
TIM6_Handler
TIM7_Handler
TIM8to11_Handler
GPIO_A_9_Handler
GPIO_A_16_Handler
GPIO_A_2to7_Handler
GPIO_A_8_10to15_Handler
GPIO_A_17to23_Handler
GPIO_A_24to31_Handler
GPIO_B_0to7_Handler
GPIO_B_8to15_Handler
GPIO_B_16to23_Handler
GPIO_B_24to31_Handler
UART3_Handler
SPI2_Handler
I2C2_Handler
DSP_Event_1_Handler
DSP_Event_2_Handler
SHA256_Handler
USB_ISOC_Handler
BT_CLK_compare_Handler
HW_RSA_Handler
PSRAM_Handler
Compare_clk_4_Handler
Compare_clk_5_Handler
dspdma_int_all_host_Handler
NNA_Handler
Compare_clk_9_Handler
Compare_clk_10_Handler
GPIO_C_0to7_Handler
GPIO_C_8to15_Handler
TIM8_Handler
TIM9_Handler
TIM10_Handler
TIM11_Handler
TIM12_Handler
TIM13_Handler
TIM14_Handler
TIM15_Handler
SPIC0_Handler
SPIC1_Handler
SPIC2_Handler
SPIC3_Handler
SDIO_HOST_Handler
SPIC4_Handler
ERR_CORR_CODE_Handler
SLAVE_PORT_MONITOR_Handler
RESERVED0_Handler
RESERVED1_Handler
RESERVED2_Handler
RESERVED3_Handler
RESERVED4_Handler
RESERVED5_Handler
RESERVED6_Handler
SPDIF_Rx_Handler
SPDIF_Tx_Handler
MBIAS_MFG_DET_L_Handler
SPI2W_Handler
LPCOMP_Handler
MBIAS_VBAT_DET_Handler
MBIAS_ADP_DET_Handler
HW_ASRC1_Handler
HW_ASRC2_Handler
VADBUF_Handler
PTA_Mailbox_Handler
DSP2MCU_Handler
SPORT2_TX_Handler
SPORT2_RX_Handler
SPORT3_TX_Handler
SPORT3_RX_Handler
VAD_Handler
ANC_Handler
SPORT0_TX_Handler
SPORT0_RX_Handler
SPORT1_TX_Handler
SPORT1_RX_Handler
USB_UTMI_SUSPEND_N_Handler
USB_DLPS_Resume_Handler
RESERVED7_Handler
ADP_IN_DET_Handler
ADP_OUT_DET_Handler
GPIOA2_Handler
GPIOA3_Handler
GPIOA4_Handler
GPIOA5_Handler
GPIOA6_Handler
GPIOA7_Handler
GPIOA8_Handler
GPIOA9_Handler
GPIOA10_Handler
GPIOA11_Handler
GPIOA12_Handler
GPIOA13_Handler
GPIOA14_Handler
GPIOA15_Handler
GPIOA16_Handler
GPIOA17_Handler
GPIOA18_Handler
GPIOA19_Handler
GPIOA20_Handler
GPIOA21_Handler
GPIOA22_Handler
GPIOA23_Handler
GPIOA24_Handler
GPIOA25_Handler
GPIOA26_Handler
GPIOA27_Handler
GPIOA28_Handler
GPIOA29_Handler
GPIOA30_Handler
GPIOA31_Handler
GPIOB0_Handler
GPIOB1_Handler
GPIOB2_Handler
GPIOB3_Handler
GPIOB4_Handler
GPIOB5_Handler
GPIOB6_Handler
GPIOB7_Handler
GPIOB8_Handler
GPIOB9_Handler
GPIOB10_Handler
GPIOB11_Handler
GPIOB12_Handler
GPIOB13_Handler
GPIOB14_Handler
GPIOB15_Handler
GPIOB16_Handler
GPIOB17_Handler
GPIOB18_Handler
GPIOB19_Handler
GPIOB20_Handler
GPIOB21_Handler
GPIOB22_Handler
GPIOB23_Handler
GPIOB24_Handler
GPIOB25_Handler
GPIOB26_Handler
GPIOB27_Handler
GPIOB28_Handler
GPIOB29_Handler
GPIOB30_Handler
GPIOB31_Handler
GPIOC0_Handler
GPIOC1_Handler
GPIOC2_Handler
GPIOC3_Handler
GPIOC4_Handler
GPIOC5_Handler
GPIOC6_Handler
GPIOC7_Handler
GPIOC8_Handler
GPIOC9_Handler
GPIOC10_Handler
GPIOC11_Handler
GPIOC12_Handler
GPIOC13_Handler
GPIOC14_Handler
GPIOC15_Handler
                IMPORT log_direct
                LDR    R0, =0x20000000
                LDR    R1, =DEFAULT_HANDLER_TXT
                MRS    R2, IPSR
                LDR    R3, =log_direct
                BLX    R3
                B      .

                ENDP


; User Initial Stack
                EXPORT  __user_setup_stackheap
__user_setup_stackheap PROC
                BX      LR
                ENDP

DEFAULT_HANDLER_TXT
                DCB "Error! Please implement your ISR Handler for IRQ %d!\n", 0 ; Null terminated string
                ALIGN

                END
